app/Models/ModelWilayah.php

SELECT *
FROM `tbl_wilayah`
---
    public function AllData()
    {
        return $this->db->table('tbl_wilayah')
            ->get()->getResultArray();

SELECT *
FROM `tbl_wilayah`
WHERE `id_wilayah` = '1'
---
    public function DetailData($id_wilayah)
    {
        return $this->db->table('tbl_wilayah')
        ->where('id_wilayah', $id_wilayah)
        ->get()->getRowArray();