app/Models/ModelApotek.php

SELECT *
FROM `tbl_apotek`
---
    public function AllData()
    {
        return $this->db->table('tbl_apotek')
            ->get()->getResultArray();