app/Models/ModelSetting.php

    public function DataWeb()
    {
        return $this->db->tabel('tbl_setting')
                ->where('id', 1)
                ->get()->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1

    public function UpdateData($data)
    {
        $this->db->table('tbl_setting')
                ->where('id', 1)
                ->update($data);
---
UPDATE `tbl_setting` SET `id` = 1, `nama_web` = 'WEB GIS SEKOLAH KOTA PADANG', `coordinat_kota` = '-0.8831111251598339, 100.35594133229799', `zoom_view` = '12'
WHERE `id` = 1